In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("salaries.csv")

In [3]:
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [6]:
 inputs=df.drop('salary_more_then_100k', axis='columns')

In [7]:
 inputs.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [8]:
 target=df['salary_more_then_100k']

In [9]:
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [10]:
from sklearn.preprocessing import LabelEncoder

In [11]:
le_company=LabelEncoder()

In [12]:
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [21]:
inputs['company_n']= le_company.fit_transform(inputs['company'])

In [22]:
inputs['job_n']= le_company.fit_transform(inputs['job'])

In [23]:
inputs['degree_n']= le_company.fit_transform(inputs['degree'])

In [24]:
inputs.head()

  company                  job     degree  company_n  degree_n  job_n
0  google      sales executive  bachelors          2         0      2
1  google      sales executive    masters          2         1      2
2  google     business manager  bachelors          2         0      0
3  google     business manager    masters          2         1      0
4  google  computer programmer  bachelors          2         0      1

In [26]:
inputs_n= inputs.drop(['company', 'job', 'degree'], axis='columns')

In [28]:
inputs_n

    company_n  degree_n  job_n
0           2         0      2
1           2         1      2
2           2         0      0
3           2         1      0
4           2         0      1
5           2         1      1
6           0         1      2
7           0         0      1
8           0         0      0
9           0         1      0
10          1         0      2
11          1         1      2
12          1         0      0
13          1         1      0
14          1         0      1
15          1         1      1

In [29]:
from sklearn import tree

In [30]:
model=tree.DecisionTreeClassifier()

In [31]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [33]:
 model.score(inputs_n,target)

1.0

model.predict([[2,1,2]])

In [36]:
model.predict([[2,0,0]])

array([1])

In [38]:
new_abc

NameError: name 'new_abc' is not defined